content/posts/nonparametric_filter.md
+++
title = "Non-parametric Filters"
author = ["Jethro Kuan"]
lastmod = 2019-12-01T04:45:41+08:00
draft = false
math = true
+++

Non-parametric filters do not make strong assumptions on the posterior
density, making them well suited for complex, multi-modal beliefs. The
representational power comes at the cost of computational complexity.

Some non-parametric techniques allow adaptivity. For example, particle
filters can adapt the number of particles based on the available
compute resources.


## Related {#related}

-   [§bayes\_filter]({{< relref "bayes_filter" >}})
